Revit 2016 API
TextNode.WidthScale Property
 Horizontal scale applied to the text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public double WidthScale { get; }
Visual Basic
Public ReadOnly Property WidthScale As Double
	Get
Visual C++
public:
property double WidthScale {
	double get ();
}
See Also
TextNode Class
Autodesk.Revit.DB Namespace